liuaiolos/esp8266-ai/firmware/src/main.cpp
// XiaoZhi-compatible ESP32-S3 WiFi clock: shows live Claude Code / Codex CLI
// working status and usage quota, polled from a bridge service running on a
// developer's Mac or Windows PC.
//
// Target display: 240x240 SPI ST7789. Pins and display settings are defined
// in platformio.ini.

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <WiFiClient.h>
#include <WiFiManager.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <TFT_eSPI.h>
#include <AnimatedGIF.h>
#if defined(HAS_DAC_SPEAKER)
#include "esp32-hal-dac.h"
#endif
#if defined(XIAOZHI_S3_LCD154)
#if ESP_ARDUINO_VERSION_MAJOR >= 3
#include <driver/i2s_std.h>
#else
#include <driver/i2s.h>
#endif
#endif

#include "config.h"
#include "audio/construction_complete_pcm.h"
#include "img/claude_sprite.h"
#include "img/codex_sprite.h"
#include "img/claude_logo.h"
#include "img/codex_logo.h"

TFT_eSPI tft = TFT_eSPI();
WebServer webServer(80);

// M5GO v2.6 uses an ILI9342C panel. M5Stack's official Core library retains
// the ILI9341 coordinate model but selects this different register sequence
// for newer LCD hardware. Applying it after TFT_eSPI::init() lets the rest of
// this firmware keep the proven 320x240 rotation and drawing coordinates.
#if defined(M5STACK)
static void initM5GoV26Panel() {
  auto command = [](uint8_t value) { tft.writecommand(value); };
  auto data = [](uint8_t value) { tft.writedata(value); };

  command(0xC8);
  data(0xFF); data(0x93); data(0x42);

  command(0xC0); // Power control 1
  data(0x12); data(0x12);
  command(0xC1); // Power control 2
  data(0x03);
  command(0xB0);
  data(0xE0);
  command(0xF6);
  data(0x00); data(0x01); data(0x01);

  command(0x36); // Memory access control; M5Stack rotation 0 baseline
  data(0xA8);    // MY | MV, with TFT_BGR color order
  command(0x3A); // 16-bit RGB565
  data(0x55);
  command(0xB6); // Display function control
  data(0x08); data(0x82); data(0x27);

  command(0xE0); // Positive gamma
  const uint8_t positiveGamma[] = {
      0x00, 0x0C, 0x11, 0x04, 0x11, 0x08, 0x37, 0x89,
      0x4C, 0x06, 0x0C, 0x0A, 0x2E, 0x34, 0x0F};
  for (uint8_t value : positiveGamma) data(value);

  command(0xE1); // Negative gamma
  const uint8_t negativeGamma[] = {
      0x00, 0x0B, 0x11, 0x05, 0x13, 0x09, 0x33, 0x67,
      0x48, 0x07, 0x0E, 0x0B, 0x2E, 0x33, 0x0F};
  for (uint8_t value : negativeGamma) data(value);

  command(0x11); // Sleep out
  delay(120);
  command(0x29); // Display on
  tft.invertDisplay(true); // Official M5Stack ILI9342C path enables INVON
}
#endif

// ---------- custom sprite storage (LittleFS) ----------
// Custom uploads replace the compiled-in default animation without needing a
// firmware rebuild. You POST a raw .gif straight to /sprite/claude or
// /sprite/codex (the device serves its own upload page at "/"); the ESP32-S3
// decodes and rescales the GIF *on-device* (AnimatedGIF, line-by-line so it
// never needs a full-canvas buffer) into the wire format below, which the
// display path then reads back frame-by-frame:
//   [1 byte frame count][frame0 bytes][frame1 bytes]...
// Each frame is exactly CLAUDE_SPRITE_W x H (or CODEX_SPRITE_W x H) RGB565
// pixels, byte order matching tools/convert_sprites.py's to_rgb565() so the
// compiled-in defaults and custom uploads share one draw path.
const char *CLAUDE_SPRITE_FILE = "/c.bin";
const char *CODEX_SPRITE_FILE = "/x.bin";
const char *CLAUDE_IDLE_FILE = "/c_idle.bin";
const char *CODEX_IDLE_FILE = "/x_idle.bin";
const char *CLAUDE_GIF_FILE = "/c.gif"; // raw upload, decoded then removed
const char *CODEX_GIF_FILE = "/x.gif";
const int MAX_CUSTOM_FRAMES = 8;
const size_t CLAUDE_FRAME_BYTES = (size_t)CLAUDE_SPRITE_W * CLAUDE_SPRITE_H * 2;
const size_t CODEX_FRAME_BYTES = (size_t)CODEX_SPRITE_W * CODEX_SPRITE_H * 2;

// We never hold a whole sprite frame in RAM. Decoding a GIF needs ~24KB of
// heap for AnimatedGIF's own buffers. The decoder therefore works one
// screen-row at a time through these two small scratch rows (SCREEN_W is the
// widest we ever need), while ESP32-S3 frame caches keep rendering smooth.
uint16_t rowBuf[SCREEN_W];     // current row being drawn / decoded
uint16_t prevRowBuf[SCREEN_W]; // decode only: same row from the previous frame
// ESP32 has enough heap for one decoded custom frame. Caching the active frame
// avoids opening/reading LittleFS once per scanline, which otherwise starves
// the HTTP server during the animation.
uint8_t spriteFrameCache[CODEX_FRAME_BYTES];
// A second frame buffer is used only at the loop seam to blend the final and
// first animation frames. It costs 28.8 KB on this ESP32 but removes the
// visible last-frame -> first-frame snap in non-seamless uploaded GIFs.
uint8_t spriteLoopBridgeCache[CODEX_FRAME_BYTES];

// Sprite/GIF/music payloads are stored in the byte-pre-swapped format emitted
// by tools/convert_sprites.py. TFT_eSPI's default ESP32 pushImage() path sends
// the uint16_t memory bytes as-is, so these rows must be passed unchanged.
inline uint16_t swap565(uint16_t c) { return (uint16_t)((c << 8) | (c >> 8)); }

bool claudeCustom = false;
int claudeCustomFrames = 0;
bool codexCustom = false;
int codexCustomFrames = 0;
bool claudeIdleCustom = false;
int claudeIdleFrames = 0;
bool codexIdleCustom = false;
int codexIdleFrames = 0;
uint32_t spriteRev = 0; // bumped on upload/reset so the Mac mirror re-fetches

const int SCREEN_CX = SCREEN_W / 2, SCREEN_CY = SCREEN_H / 2;
const int RING_MARGIN = 4;      // inset from screen edge
const int RING_THICKNESS = 10;  // ring bar thickness
const unsigned long ANIM_INTERVAL_MS = 90;   // sprite frame advance
const unsigned long ANIM_LOOP_BRIDGE_MS = 45; // short final->first blend
const unsigned long FLASH_INTERVAL_MS = 400; // "urgent" flash speed
const unsigned long SWITCH_BOTH_MS = 2000;   // both apps working: alternate fast
const unsigned long SWITCH_IDLE_MS = 6000;   // neither working: alternate slow

enum ActiveApp { APP_CLAUDE, APP_CODEX };
// First boot should introduce the device with Codex on screen.  A previously
// saved display-mode preference still takes precedence in loadDisplayMode().
ActiveApp currentApp = APP_CODEX;
unsigned long lastSwitchMs = 0;

// Display override, settable from the Mac app via POST /api/display:
// auto = follow working status, claude/codex = pin that app on screen,
// net/music = show Mac-side telemetry pages instead of the pet.
enum DisplayMode { MODE_AUTO, MODE_CLAUDE, MODE_CODEX, MODE_NET, MODE_MUSIC };
DisplayMode displayMode = MODE_AUTO;
bool appRedrawRequested = false; // defer expensive TFT work until after HTTP replies

// When AUTO and the Mac reports audio playing, the screen auto-switches to the
// music page and back when it stops — same spirit as the Claude/Codex auto
// switch. Only AUTO does this; a pinned mode is always honored as-is.
bool statusMusicPlaying = false;
DisplayMode lastEffectiveMode = MODE_AUTO;

// ---------- net speed mode state ----------
// Rendering is decoupled from the network: pollNet() fetches every 2s and
// only refills a queue of 250ms samples (the bridge samples at 4Hz and tags
// them with a running seq, so nothing is drawn twice or skipped). The sweep
// itself consumes exactly one queued sample every NET_DRAW_INTERVAL_MS, so
// the trace advances at a constant rate no matter how long HTTP takes.
const unsigned long NET_POLL_INTERVAL_MS = 2000; // queue refill cadence
const unsigned long NET_DRAW_INTERVAL_MS = 250;  // one chart step per bridge sample
const int NET_QUEUE = 32;
long netQRx[NET_QUEUE], netQTx[NET_QUEUE]; // ring buffer of pending samples
int netQHead = 0, netQCount = 0;
long netSeq = -1;                          // last bridge sample seq consumed into the queue
long netCurRx = 0, netCurTx = 0;           // smoothed readout for the header
unsigned long lastNetPollMs = 0;
unsigned long lastNetDrawMs = 0;
bool netChromeDrawn = false;
bool netHeaderDirty = false;

// Chart layout (task-manager style scrolling area chart, newest at the right)
#if defined(T_EMBED_CC1101)
const int NET_CHART_X = 8, NET_CHART_Y = 82, NET_CHART_W = 154, NET_CHART_H = 180;
#else
const int NET_CHART_X = 8, NET_CHART_Y = 60, NET_CHART_W = 224, NET_CHART_H = 128;
#endif
long netHistRx[NET_CHART_W], netHistTx[NET_CHART_W]; // one 250ms sample per column
long netScale = 10240;    // current "nice" full-scale value (whole chart shares it)
String netLastDl, netLastUl, netLastScaleText; // change detection for partial redraws

// ---------- music mode state ----------
const int MUSIC_COVER_W = 128;
const int MUSIC_COVER_H = 128;
// Title/artist come as a Mac-rendered bitmap strip (232x44) because the
// panel fonts are ASCII-only and CJK titles would render as blanks.
// The T-Embed is narrower than the Mac's 232px text-strip endpoint.
#if defined(T_EMBED_CC1101)
const int MUSIC_TEXT_W = 162;
#else
const int MUSIC_TEXT_W = 232;
#endif
const int MUSIC_TEXT_H = 44;
#if defined(T_EMBED_CC1101)
const int MUSIC_TEXT_X = 4, MUSIC_TEXT_Y = 154;
#else
const int MUSIC_TEXT_X = 4, MUSIC_TEXT_Y = 150;
#endif
const unsigned long MUSIC_POLL_INTERVAL_MS = 2000;
String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

int claudeFrame = 0;
int codexFrame = 0;
bool claudeLoopBridgePending = false;
bool codexLoopBridgePending = false;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the Wi-Fi configuration portal is visible
bool webServerStarted = false; // deferred because the portal also occupies port 80
uint8_t bridgeFailCount = 0;
unsigned long lastWiFiReconnectMs = 0;
bool statusBaselineReady = false;
unsigned long beepUntilMs = 0;
const int SPEAKER_CHANNEL = 1;
int completionVolume = COMPLETION_SOUND_VOLUME_DEFAULT; // 0-100
// HTTP handlers run on Core 0, while the Arduino loop (and Hook completion)
// runs on the app core. Queue preview playback so its DAC timing matches the
// normal completion path instead of competing with Wi-Fi on the HTTP core.
volatile bool previewSoundRequested = false;

