liuaiolos/esp8266-ai/firmware/src/main.cpp
// The supplied WAV is peak-normalized and low-pass downsampled at build time to
// unsigned 8-bit mono PCM (11,025 Hz), a stable rate for GPIO 25's direct DAC.
// GPIO 25 is ESP32 DAC1 and feeds the
// M5GO's built-in speaker, so this needs no SD card or LittleFS upload.
constexpr uint32_t COMPLETION_SAMPLE_RATE = 11025;

#if defined(HAS_DAC_SPEAKER)
void restoreSpeakerToneOutput() {
  dacWrite(SPEAKER_PIN, 0);
  ledcAttachPin(SPEAKER_PIN, SPEAKER_CHANNEL);
  ledcWriteTone(SPEAKER_CHANNEL, 0);
  ledcWrite(SPEAKER_CHANNEL, 0);
}

void playCompletionSound() {
  if (construction_complete_pcm_len == 0) return;

  // LEDC and the DAC cannot drive GPIO 25 at the same time.
  ledcWriteTone(SPEAKER_CHANNEL, 0);
  ledcWrite(SPEAKER_CHANNEL, 0);
  ledcDetachPin(SPEAKER_PIN);

  // Keep the real 11,025 Hz average interval (90 + fractional microseconds)
  // rather than relying on delayMicroseconds(), whose call overhead changes
  // the playback pitch.
  uint32_t nextSampleAt = micros();
  uint32_t fractionalUs = 0;
  constexpr uint32_t wholeUs = 1000000UL / COMPLETION_SAMPLE_RATE;
  constexpr uint32_t remainderUs = 1000000UL % COMPLETION_SAMPLE_RATE;
  for (size_t i = 0; i < construction_complete_pcm_len; ++i) {
    int sample = (int)pgm_read_byte(construction_complete_pcm + i) - 128;
    sample = sample * completionVolume / COMPLETION_SOUND_VOLUME_MAX;
    dacWrite(SPEAKER_PIN, sample + 128);

    nextSampleAt += wholeUs;
    fractionalUs += remainderUs;
    if (fractionalUs >= COMPLETION_SAMPLE_RATE) {
      nextSampleAt++;
      fractionalUs -= COMPLETION_SAMPLE_RATE;
    }
    while ((int32_t)(micros() - nextSampleAt) < 0) {
      // Busy wait preserves the sample clock; Wi-Fi continues on the other core.
    }
  }
  restoreSpeakerToneOutput();
}

void triggerCompletionBeep() {
  if (construction_complete_pcm_len > 0) {
    playCompletionSound();
    return;
  }
  // Kept as a safe fallback if the asset is ever removed from a custom build.
  beepUntilMs = millis() + 120;
  ledcWriteTone(SPEAKER_CHANNEL, 520);
  ledcWrite(SPEAKER_CHANNEL, 24);
}

void updateBeep() {
  if (beepUntilMs != 0 && millis() >= beepUntilMs) {
    ledcWriteTone(SPEAKER_CHANNEL, 0);
    ledcWrite(SPEAKER_CHANNEL, 0);
    beepUntilMs = 0;
  }
}
#elif defined(XIAOZHI_S3_LCD154)
// The Zhengchen board's amplifier receives 32-bit, left-slot I2S audio.
#if ESP_ARDUINO_VERSION_MAJOR >= 3
i2s_chan_handle_t speakerI2sChannel = nullptr;
#else
i2s_port_t speakerI2sPort = I2S_NUM_0;
#endif
bool speakerI2sReady = false;

void initI2sSpeaker() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  // This is the same ESP-IDF standard-mode configuration used by the
  // original Zhengchen firmware, including the left-slot 32-bit framing.
  i2s_chan_config_t channelConfig = {};
  channelConfig.id = I2S_NUM_0;
  channelConfig.role = I2S_ROLE_MASTER;
  channelConfig.dma_desc_num = 6;
  channelConfig.dma_frame_num = 240;
  channelConfig.auto_clear_after_cb = true;
  if (i2s_new_channel(&channelConfig, &speakerI2sChannel, nullptr) != ESP_OK) {
    speakerI2sChannel = nullptr;
    Serial.println("[audio] unable to create I2S speaker channel");
    return;
  }

  i2s_std_config_t config = {};
  config.clk_cfg.sample_rate_hz = 24000;
  config.clk_cfg.clk_src = I2S_CLK_SRC_DEFAULT;
  config.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_256;
  config.slot_cfg.data_bit_width = I2S_DATA_BIT_WIDTH_32BIT;
  config.slot_cfg.slot_bit_width = I2S_SLOT_BIT_WIDTH_AUTO;
  config.slot_cfg.slot_mode = I2S_SLOT_MODE_MONO;
  config.slot_cfg.slot_mask = I2S_STD_SLOT_LEFT;
  config.slot_cfg.ws_width = I2S_DATA_BIT_WIDTH_32BIT;
  config.slot_cfg.ws_pol = false;
  config.slot_cfg.bit_shift = true;
#ifdef I2S_HW_VERSION_2
  config.slot_cfg.left_align = true;
  config.slot_cfg.big_endian = false;
  config.slot_cfg.bit_order_lsb = false;
#endif
  config.gpio_cfg.mclk = I2S_GPIO_UNUSED;
  config.gpio_cfg.bclk = (gpio_num_t)SPEAKER_I2S_BCLK;
  config.gpio_cfg.ws = (gpio_num_t)SPEAKER_I2S_LRCK;
  config.gpio_cfg.dout = (gpio_num_t)SPEAKER_I2S_DOUT;
  config.gpio_cfg.din = I2S_GPIO_UNUSED;
  if (i2s_channel_init_std_mode(speakerI2sChannel, &config) != ESP_OK ||
      i2s_channel_enable(speakerI2sChannel) != ESP_OK) {
    Serial.println("[audio] unable to initialize I2S speaker");
    speakerI2sChannel = nullptr;
    return;
  }
#else
  i2s_config_t config = {};
  config.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX);
  config.sample_rate = 24000;
  config.bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT;
  config.channel_format = I2S_CHANNEL_FMT_ONLY_LEFT;
  config.communication_format = I2S_COMM_FORMAT_STAND_I2S;
  config.dma_buf_count = 6;
  config.dma_buf_len = 240;
  config.tx_desc_auto_clear = true;
  if (i2s_driver_install(speakerI2sPort, &config, 0, nullptr) != ESP_OK) {
    Serial.println("[audio] unable to create I2S speaker channel");
    return;
  }

  i2s_pin_config_t pins = {};
  pins.bck_io_num = SPEAKER_I2S_BCLK;
  pins.ws_io_num = SPEAKER_I2S_LRCK;
  pins.data_out_num = SPEAKER_I2S_DOUT;
  pins.data_in_num = I2S_PIN_NO_CHANGE;
  pins.mck_io_num = I2S_PIN_NO_CHANGE;
  if (i2s_set_pin(speakerI2sPort, &pins) != ESP_OK) {
    Serial.println("[audio] unable to initialize I2S speaker");
    i2s_driver_uninstall(speakerI2sPort);
    return;
  }
#endif
  speakerI2sReady = true;
  Serial.println("[audio] I2S standard speaker ready");
}

void playCompletionSoundI2s() {
  if (!speakerI2sReady || completionVolume == 0 ||
      construction_complete_pcm_len < 2) return;

  // The bundled header is the normalized 11,025 Hz mono PCM derived from
  // assets/construction_complete.wav.  Keep the board's 24 kHz I2S clock and
  // linearly resample each sample into that stream.
  constexpr uint32_t kSourceSampleRate = COMPLETION_SAMPLE_RATE;
  constexpr uint32_t kOutputSampleRate = 24000;
  constexpr size_t kChunkSamples = 240;
  int32_t samples[kChunkSamples];
  const size_t outputSamples =
      (construction_complete_pcm_len - 1) * kOutputSampleRate / kSourceSampleRate;
  for (size_t offset = 0; offset < outputSamples; offset += kChunkSamples) {
    size_t count = min(kChunkSamples, outputSamples - offset);
    for (size_t i = 0; i < count; ++i) {
      uint64_t sourcePosition = (uint64_t)(offset + i) * kSourceSampleRate;
      size_t sourceIndex = sourcePosition / kOutputSampleRate;
      uint32_t fraction = sourcePosition % kOutputSampleRate;
      int64_t sampleA = ((int)pgm_read_byte(construction_complete_pcm + sourceIndex) - 128) * 16777216LL;
      int64_t sampleB = ((int)pgm_read_byte(construction_complete_pcm + sourceIndex + 1) - 128) * 16777216LL;
      int64_t interpolated = sampleA + (sampleB - sampleA) * fraction / kOutputSampleRate;
      samples[i] = (int32_t)(interpolated * completionVolume /
                             COMPLETION_SOUND_VOLUME_MAX);
    }
    size_t bytesWritten = 0;
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_err_t result = i2s_channel_write(speakerI2sChannel, samples,
                                         count * sizeof(int32_t), &bytesWritten,
                                         portMAX_DELAY);
#else
    esp_err_t result = i2s_write(speakerI2sPort, samples, count * sizeof(int32_t),
                                 &bytesWritten, portMAX_DELAY);
#endif
    if (result != ESP_OK) {
      Serial.println("[audio] I2S speaker write failed");
      return;
    }
  }
}

void triggerCompletionBeep() {
  playCompletionSoundI2s();
}

void updateBeep() {}
#else
void initI2sSpeaker() {}
void triggerCompletionBeep() {}
void updateBeep() {}
#endif

// Quota values from the bridge are always "used" percentages. This preference
// only changes how they are rendered, not the exhausted-window countdown.
bool showQuotaRemaining = false;

// ---------- backlight brightness ----------
// This board's panel backlight (TFT_BL, active HIGH) is PWM-dimmable.
// 0 = off, 100 = full. Persisted so it survives reboot.

int brightness = BRIGHTNESS_DEFAULT; // 0-100

void loadQuotaDisplay() {
  if (!LittleFS.exists(QUOTA_DISPLAY_FILE)) return;
  File f = LittleFS.open(QUOTA_DISPLAY_FILE, "r");
  if (!f) return;
  String value = f.readStringUntil('\n');
  value.trim();
  f.close();
  showQuotaRemaining = value == "remaining";
}

