liuaiolos/esp8266-ai/firmware/src/main.cpp
void saveQuotaDisplay() {
  File f = LittleFS.open(QUOTA_DISPLAY_FILE, "w");
  if (!f) return;
  f.println(showQuotaRemaining ? "remaining" : "used");
  f.close();
}

float displayedQuotaPct(float usedPct) {
  if (usedPct < 0) return usedPct;
  return showQuotaRemaining ? 100.0f - usedPct : usedPct;
}

void loadDisplayMode() {
  if (!LittleFS.exists(DISPLAY_MODE_FILE)) return;
  File f = LittleFS.open(DISPLAY_MODE_FILE, "r");
  if (!f) return;
  String value = f.readStringUntil('\n');
  value.trim();
  f.close();
  if (value == "claude") displayMode = MODE_CLAUDE;
  else if (value == "codex") displayMode = MODE_CODEX;
  else if (value == "net") displayMode = MODE_NET;
  else if (value == "music") displayMode = MODE_MUSIC;
  else displayMode = MODE_AUTO;
}

void saveDisplayMode() {
  const char *value = "auto";
  if (displayMode == MODE_CLAUDE) value = "claude";
  else if (displayMode == MODE_CODEX) value = "codex";
  else if (displayMode == MODE_NET) value = "net";
  else if (displayMode == MODE_MUSIC) value = "music";
  File f = LittleFS.open(DISPLAY_MODE_FILE, "w");
  if (!f) return;
  f.println(value);
  f.close();
}

void applyBrightness() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(TFT_BL, map(brightness, 0, 100, 0, 255));
#else
  ledcWrite(0, map(brightness, 0, 100, 0, 255));
#endif
}

void loadBrightness() {
  if (!LittleFS.exists(BRIGHTNESS_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 100) brightness = v;
}

void saveBrightness() {
  File f = LittleFS.open(BRIGHTNESS_FILE, "w");
  if (!f) return;
  f.println(brightness);
  f.close();
}

void loadCompletionVolume() {
  if (!LittleFS.exists(COMPLETION_VOLUME_FILE)) return;
  File f = LittleFS.open(COMPLETION_VOLUME_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= COMPLETION_SOUND_VOLUME_MAX) completionVolume = v;
}

void saveCompletionVolume() {
  File f = LittleFS.open(COMPLETION_VOLUME_FILE, "w");
  if (!f) return;
  f.println(completionVolume);
  f.close();
}

// ---------- persistence for the bridge host ----------

void loadBridgeHost() {
  if (LittleFS.exists(WIFI_CONFIG_FILE)) {
    File f = LittleFS.open(WIFI_CONFIG_FILE, "r");
    bridgeHost = f.readStringUntil('\n');
    bridgeHost.trim();
    f.close();
  }
}

void saveBridgeHost(const String &host) {
  File f = LittleFS.open(WIFI_CONFIG_FILE, "w");
  f.println(host);
  f.close();
}

// ---------- custom sprite loading ----------

// Checks LittleFS for a previously-uploaded custom sprite and validates its
// size before trusting it (frame count byte + exact expected byte length).
void loadCustomSpriteState() {
  auto load = [](const char *path, size_t frameBytes, bool &ok, int &frames) {
    ok = false; frames = 0;
    File f = LittleFS.open(path, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * frameBytes;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        ok = true; frames = cnt;
      }
    }
    if (f) f.close();
  };
  load(CLAUDE_SPRITE_FILE, CLAUDE_FRAME_BYTES, claudeCustom, claudeCustomFrames);
  load(CODEX_SPRITE_FILE, CODEX_FRAME_BYTES, codexCustom, codexCustomFrames);
  load(CLAUDE_IDLE_FILE, CLAUDE_FRAME_BYTES, claudeIdleCustom, claudeIdleFrames);
  load(CODEX_IDLE_FILE, CODEX_FRAME_BYTES, codexIdleCustom, codexIdleFrames);

  Serial.printf("[sprite] claude custom=%d frames=%d | codex custom=%d frames=%d\n", claudeCustom,
                claudeCustomFrames, codexCustom, codexCustomFrames);
}

int claudeFrameCount() { return claudeCustom ? claudeCustomFrames : CLAUDE_SPRITE_FRAMES; }
int codexFrameCount() { return codexCustom ? codexCustomFrames : CODEX_SPRITE_FRAMES; }
int claudeIdleFrameCount() { return claudeIdleCustom ? claudeIdleFrames : claudeFrameCount(); }
int codexIdleFrameCount() { return codexIdleCustom ? codexIdleFrames : codexFrameCount(); }

bool loadSpriteFrame(bool custom, const char *file, const uint16_t *const *progmemFrames, int frameIdx,
                     size_t frameBytes, uint8_t *out) {
  if (custom) {
    File f = LittleFS.open(file, "r");
    if (!f) return false;
    f.seek(1 + (size_t)frameIdx * frameBytes);
    bool ok = f.read(out, frameBytes) == (int)frameBytes;
    f.close();
    return ok;
  }
  const uint16_t *frame = progmemFrames[frameIdx];
  memcpy_P(out, frame, frameBytes);
  return true;
}

// Draws one sprite frame from a full-frame cache. A single pushImage call is
// substantially smoother than issuing one SPI transaction per scanline.
void drawSpriteFrame(bool custom, const char *file, const uint16_t *const *progmemFrames, int frameIdx, int w,
                     int h, size_t frameBytes) {
  if (!loadSpriteFrame(custom, file, progmemFrames, frameIdx, frameBytes, spriteFrameCache)) return;
  int x0 = SCREEN_CX - w / 2, y0 = SCREEN_CY - h / 2;
  tft.pushImage(x0, y0, w, h, reinterpret_cast<uint16_t *>(spriteFrameCache));
}

// A short cross-fade at the loop seam is only used while a pet is working.
// It makes GIFs whose final pose does not exactly meet their first pose loop
// continuously without adding a duplicate hold frame.
void drawSpriteLoopBridge(bool custom, const char *file, const uint16_t *const *progmemFrames, int count, int w,
                          int h, size_t frameBytes) {
  if (count < 2 ||
      !loadSpriteFrame(custom, file, progmemFrames, count - 1, frameBytes, spriteFrameCache) ||
      !loadSpriteFrame(custom, file, progmemFrames, 0, frameBytes, spriteLoopBridgeCache)) return;
  uint16_t *last = reinterpret_cast<uint16_t *>(spriteFrameCache);
  const uint16_t *first = reinterpret_cast<const uint16_t *>(spriteLoopBridgeCache);
  for (size_t i = 0; i < frameBytes / 2; ++i) {
    // Sprite frames are byte-normalized for TFT_eSPI, so swap to regular
    // RGB565 before averaging and swap back for pushImage().
    uint16_t a = swap565(last[i]);
    uint16_t b = swap565(first[i]);
    uint16_t blended = ((a & 0xF7DE) >> 1) + ((b & 0xF7DE) >> 1);
    last[i] = swap565(blended);
  }
  int x0 = SCREEN_CX - w / 2, y0 = SCREEN_CY - h / 2;
  tft.pushImage(x0, y0, w, h, last);
}

// ---------- helpers ----------

String formatTokens(long tokens) {
  if (tokens >= 1000000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fM", tokens / 1000000.0);
    return String(buf);
  }
  if (tokens >= 1000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fk", tokens / 1000.0);
    return String(buf);
  }
  return String(tokens);
}

// ---------- drawing ----------

void drawStaticChrome() {
  tft.fillScreen(TFT_BLACK);
}

// Bridge unreachable / data stale -> flashing red overrides everything else,
// matches the "urgent, look now" state from the reference signal-light design.
bool bridgeStale() {
  if (!everPolled) return true;
  return (millis() - lastSuccessMs) >= 5UL * BRIDGE_POLL_INTERVAL_MS;
}

// True when the app currently on screen is waiting on a permission/approval
// prompt — drives the red "look now, act" border flash.
bool currentAppNeedsInput() {
  return currentApp == APP_CLAUDE ? claudeStatus.needsInput : codexStatus.needsInput;
}

// Working vs idle is now conveyed by the sprite animation itself (moving vs
// still), not by ring color. The ring just stays steady green, except
// bridge-stale which flashes red ("check it now") and overrides everything.
uint16_t currentStatusColor() {
  if (bridgeStale()) return flashOn ? TFT_RED : TFT_BLACK;
  return TFT_GREEN;
}

// The ring is skipped when nothing changed (see drawSquareRing) so the 5s
// poll doesn't visibly blank-and-repaint it. Anything that paints over the
// ring area must invalidate this cache.
float ringLastPct = -1000;
uint16_t ringLastColor = 1;

