liuaiolos/esp8266-ai/firmware/src/main.cpp
// Paints the full square border in one color (all four sides), used for the
// attention flash so the whole edge blinks, not just the filled quota arc.
void drawFullBorder(uint16_t color) {
  ringLastPct = -1000; // ring got painted over; next ring draw must repaint
  int x0 = RING_MARGIN, y0 = RING_MARGIN;
  int horizontal = SCREEN_W - 2 * RING_MARGIN;
  int vertical = SCREEN_H - 2 * RING_MARGIN;
  tft.fillRect(x0, y0, horizontal, RING_THICKNESS, color); // top
  tft.fillRect(x0, SCREEN_H - RING_MARGIN - RING_THICKNESS,
               horizontal, RING_THICKNESS, color); // bottom
  tft.fillRect(x0, y0, RING_THICKNESS, vertical, color); // left
  tft.fillRect(SCREEN_W - RING_MARGIN - RING_THICKNESS, y0,
               RING_THICKNESS, vertical, color); // right
}

// Rectangular progress ring hugging the screen edge. `pct` of the perimeter
// is drawn clockwise: full top -> full right -> full bottom -> partial left.
// The unused portion is black; complete sides overlap at the corners so a
// later, partial side can never erase a corner that is already complete.
void drawSquareRing(float pct, uint16_t color) {
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  if (pct == ringLastPct && color == ringLastColor) return; // nothing changed
  ringLastPct = pct;
  ringLastColor = color;

  int x0 = RING_MARGIN, y0 = RING_MARGIN;
  int x1 = SCREEN_W - RING_MARGIN, y1 = SCREEN_H - RING_MARGIN;
  int horizontal = x1 - x0;
  int vertical = y1 - y0;
  float perimeter = 2.0f * (horizontal + vertical);

  // Clear all four complete sides first. Full side rectangles deliberately
  // overlap at the corners: once a side is complete, its corner must remain
  // filled instead of being reassigned to a later, still-incomplete side.
  tft.fillRect(x0, y0, horizontal, RING_THICKNESS, TFT_BLACK);
  tft.fillRect(x1 - RING_THICKNESS, y0, RING_THICKNESS, vertical, TFT_BLACK);
  tft.fillRect(x0, y1 - RING_THICKNESS, horizontal, RING_THICKNESS, TFT_BLACK);
  tft.fillRect(x0, y0, RING_THICKNESS, vertical, TFT_BLACK);

  // filled portion, clockwise: top -> right -> bottom -> left
  float remaining = perimeter * (pct / 100.0);
  if (remaining <= 0) return;

  float seg = min(remaining, (float)horizontal);
  tft.fillRect(x0, y0, (int)seg, RING_THICKNESS, color);
  remaining -= horizontal;
  if (remaining <= 0) return;

  seg = min(remaining, (float)vertical);
  tft.fillRect(x1 - RING_THICKNESS, y0,
               RING_THICKNESS, (int)seg, color);
  remaining -= vertical;
  if (remaining <= 0) return;

  seg = min(remaining, (float)horizontal);
  tft.fillRect(x1 - (int)seg, y1 - RING_THICKNESS,
               (int)seg, RING_THICKNESS, color);
  remaining -= horizontal;
  if (remaining <= 0) return;

  seg = min(remaining, (float)vertical);
  // The bottom-left corner is already painted by the completed bottom side.
  // If the first few pixels of the left side are drawn inside that same 10px
  // corner they become invisible (79% is only ~3px beyond three full sides).
  // Extend the left fill through its shared corner, so `visibleSeg` always
  // starts immediately above the bottom edge and remains perceptible.
  int visibleSeg = max(1, (int)ceilf(seg));
  int leftFillHeight = min(vertical, RING_THICKNESS + visibleSeg);
  tft.fillRect(x0, y1 - leftFillHeight, RING_THICKNESS, leftFillHeight, color);
}

void drawClaudeSprite(int frameIdx, bool working = true) {
  int count = working ? claudeFrameCount() : claudeIdleFrameCount();
  if (count > 0) frameIdx %= count;
  drawSpriteFrame(working ? claudeCustom : claudeIdleCustom,
                  working ? CLAUDE_SPRITE_FILE : CLAUDE_IDLE_FILE, claude_sprite_frames, frameIdx,
                  CLAUDE_SPRITE_W, CLAUDE_SPRITE_H, CLAUDE_FRAME_BYTES);
}

void drawClaudeLoopBridge() {
  drawSpriteLoopBridge(claudeCustom, CLAUDE_SPRITE_FILE, claude_sprite_frames, claudeFrameCount(),
                       CLAUDE_SPRITE_W, CLAUDE_SPRITE_H, CLAUDE_FRAME_BYTES);
}

void drawCodexSprite(int frameIdx, bool working = true) {
  int count = working ? codexFrameCount() : codexIdleFrameCount();
  if (count > 0) frameIdx %= count;
  drawSpriteFrame(working ? codexCustom : codexIdleCustom,
                  working ? CODEX_SPRITE_FILE : CODEX_IDLE_FILE, codex_sprite_frames, frameIdx,
                  CODEX_SPRITE_W, CODEX_SPRITE_H, CODEX_FRAME_BYTES);
}

void drawCodexLoopBridge() {
  drawSpriteLoopBridge(codexCustom, CODEX_SPRITE_FILE, codex_sprite_frames, codexFrameCount(),
                       CODEX_SPRITE_W, CODEX_SPRITE_H, CODEX_FRAME_BYTES);
}

String pctText(float pct) {
  return pct >= 0 ? String((int)pct) + "%" : "-";
}

// Quota readout below the sprite. Normally it has 5h / Wk columns; a
// weekly-only Codex plan uses one centered "Weekly 42%" line, matching the
// desktop mirror. Values repaint only when their text changes (force = after
// a full-screen clear), so status polling never flashes them.
#if defined(T_EMBED_CC1101)
const int QUOTA_LABEL_Y = 253, QUOTA_VALUE_Y = 272;
const int QUOTA_COL1_X = 48, QUOTA_COL2_X = 122;
#else
const int QUOTA_LABEL_Y = 183, QUOTA_VALUE_Y = 199;
const int QUOTA_COL1_X = 70, QUOTA_COL2_X = 170;
#endif
const int QUOTA_CLEAR_X = RING_MARGIN + RING_THICKNESS;
const int QUOTA_CLEAR_W = SCREEN_W - 2 * QUOTA_CLEAR_X;
String lastQuota5h, lastQuotaWk;
bool lastQuotaHasHour = true;

// Faux-bold: the packed TFT_eSPI fonts have no bold face, so draw twice with
// a 1px x offset. Transparent draws - the caller must have cleared the region.
void drawBoldString(const String &s, int x, int y, int font, uint16_t color) {
  tft.setTextColor(color);
  tft.drawString(s, x, y, font);
  tft.drawString(s, x + 1, y, font);
}

void drawQuotaText(float hourPct, float weekPct, bool hasHourQuota, bool force) {
  tft.setTextDatum(TC_DATUM);
  if (force || hasHourQuota != lastQuotaHasHour) {
    // A layout switch must erase both the old labels and values (in
    // particular, the former 5h column) before drawing the new arrangement.
    // Never clear through the edge ring. At 85%, the left-side fill occupies
    // y=168..235; the former full-width clears at y=183..224 erased its middle
    // (and the matching right edge), leaving the isolated block seen on M5.
    tft.fillRect(QUOTA_CLEAR_X, QUOTA_LABEL_Y, QUOTA_CLEAR_W, 18, TFT_BLACK);
    tft.fillRect(QUOTA_CLEAR_X, QUOTA_VALUE_Y, QUOTA_CLEAR_W, 26, TFT_BLACK);
    lastQuota5h = "";
    lastQuotaWk = "";
    lastQuotaHasHour = hasHourQuota;
    if (hasHourQuota) {
      drawBoldString("5h", QUOTA_COL1_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
      drawBoldString("Wk", QUOTA_COL2_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
    }
  }
  String v1 = pctText(hourPct), v2 = pctText(weekPct);
  if (hasHourQuota && v1 != lastQuota5h) {
    lastQuota5h = v1;
    tft.fillRect(QUOTA_COL1_X - 50, QUOTA_VALUE_Y, 100, 26, TFT_BLACK);
    drawBoldString(v1, QUOTA_COL1_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
  }
  if (v2 != lastQuotaWk) {
    lastQuotaWk = v2;
    if (hasHourQuota) {
      tft.fillRect(QUOTA_COL2_X - 50, QUOTA_VALUE_Y, 100, 26, TFT_BLACK);
      drawBoldString(v2, QUOTA_COL2_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
    } else {
      // There is no 5h value to pair with it, so give the weekly value the
      // full width instead of retaining the old two-line mobile layout.
      tft.fillRect(QUOTA_CLEAR_X, QUOTA_VALUE_Y, QUOTA_CLEAR_W, 26, TFT_BLACK);
#if defined(T_EMBED_CC1101)
      drawBoldString("Wk " + v2, SCREEN_CX, QUOTA_VALUE_Y + 2, 2, TFT_WHITE);
#else
      drawBoldString("Weekly " + v2, SCREEN_CX, QUOTA_VALUE_Y, 4, TFT_WHITE);
#endif
    }
  }
}

// ---------- quota-exhausted countdown ----------
// When the current app's 5h or weekly window is used up, the pet is replaced
// by a countdown to that window's reset (bridge sends minutes-until-reset).
// A spent weekly window blocks usage even after the 5h one resets, so the
// weekly countdown takes priority when both are exhausted.

