liuaiolos/esp8266-ai/firmware/src/main.cpp
// Rescales one decoded native line into target rows, compositing over the
// previous frame, and streams every target row it can now finalize.
void gifDrawCB(GIFDRAW *pDraw) {
  GifDecodeCtx *ctx = (GifDecodeCtx *)pDraw->pUser;
  int sy = pDraw->iY + pDraw->y; // absolute source line on the GIF canvas
  if (sy < 0 || sy >= ctx->canvasH) return;

  const uint8_t *pal = pDraw->pPalette24; // RGB888, 256 entries
  const uint8_t *src = pDraw->pPixels;    // palette indices, one per pixel of this line
  bool hasTrans = pDraw->ucHasTransparency;
  uint8_t transIdx = pDraw->ucTransparent;

  // Emit every target row whose nearest source line is <= sy and isn't done yet.
  while (ctx->producedRow < ctx->targetH) {
    int ty = ctx->producedRow;
    int srcRow = (int)((long)ty * ctx->canvasH / ctx->targetH);
    if (srcRow > sy) break;                       // needs a later source line
    if (srcRow < sy) { emitPrevRow(ctx); continue; } // source line was skipped -> previous frame

    // srcRow == sy: composite this source line over the previous frame's row.
    readPrevRow(ctx);
    memcpy(rowBuf, prevRowBuf, ctx->rowBytes);
    for (int tx = 0; tx < ctx->targetW; tx++) {
      int sx = (int)((long)tx * ctx->canvasW / ctx->targetW);
      int rel = sx - pDraw->iX;
      if (rel < 0 || rel >= pDraw->iWidth) continue; // outside this frame's rect: keep previous pixel
      uint8_t idx = src[rel];
      if (hasTrans && idx == transIdx) continue;     // transparent: keep previous pixel
      uint8_t r = pal[idx * 3 + 0], g = pal[idx * 3 + 1], b = pal[idx * 3 + 2];
      uint16_t val = ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
      rowBuf[tx] = (uint16_t)(((val & 0xFF) << 8) | (val >> 8)); // byte-swap to match convert_sprites.py
    }
    emitRow(ctx);
  }
}

// Decodes gifPath into binPath in the [count][frames...] wire format the
// display path reads. Returns false on open/decode failure.
bool decodeGifToBin(const char *gifPath, const char *binPath, int targetW, int targetH) {
  // AnimatedGIF's internal state (~24KB of LZW/line/palette buffers) is big, so
  // allocate it on the heap only for the duration of a decode rather than
  // paying for it in .bss for the whole uptime.
  AnimatedGIF *gif = new AnimatedGIF();
  if (!gif) return false;
  gif->begin(GIF_PALETTE_RGB888);
  if (!gif->open(gifPath, gifOpenCB, gifCloseCB, gifReadCB, gifSeekCB, gifDrawCB)) {
    Serial.printf("[gif] open failed err=%d\n", gif->getLastError());
    delete gif;
    return false;
  }

  GifDecodeCtx ctx;
  ctx.canvasW = gif->getCanvasWidth();
  ctx.canvasH = gif->getCanvasHeight();
  ctx.targetW = targetW;
  ctx.targetH = targetH;
  ctx.rowBytes = (size_t)targetW * 2;
  ctx.hasPrev = false;
  size_t frameBytes = (size_t)targetW * targetH * 2;

  ctx.out = LittleFS.open(binPath, "w");
  if (!ctx.out) {
    gif->close();
    delete gif;
    return false;
  }
  ctx.out.write((uint8_t)0); // placeholder frame count, patched once we know the total

  uint8_t count = 0;
  int delayMs = 0, more = 1;
  while (count < MAX_CUSTOM_FRAMES) {
    ctx.producedRow = 0;
    ctx.hasPrev = false;
    if (count > 0) {
      ctx.out.flush(); // make the just-written previous frame visible to the read handle
      ctx.prevFile = LittleFS.open(binPath, "r");
      ctx.hasPrev = (bool)ctx.prevFile;
      if (ctx.hasPrev) ctx.prevFile.seek(1 + (size_t)(count - 1) * frameBytes);
    }

    more = gif->playFrame(false, &delayMs, &ctx);

    if (more >= 0) {
      // finalize any bottom rows this frame never touched
      while (ctx.producedRow < ctx.targetH) emitPrevRow(&ctx);
      count++;
    }
    if (ctx.prevFile) ctx.prevFile.close();
    if (more <= 0) break; // 0 = last frame, <0 = decode error
    yield();              // feed the WDT between frames
  }
  gif->close();
  delete gif;
  ctx.out.close();

  if (count == 0) {
    LittleFS.remove(binPath);
    return false;
  }
  File patch = LittleFS.open(binPath, "r+");
  if (patch) {
    patch.seek(0);
    patch.write(count);
    patch.close();
  }
  Serial.printf("[gif] decoded %d frame(s) %dx%d -> %dx%d\n", count, ctx.canvasW, ctx.canvasH, targetW, targetH);
  return true;
}

// ---------- sprite upload (raw .gif -> on-device decode) ----------
// WebServer fully buffers a plain POST body into a heap String before
// the handler runs, which a whole GIF would blow RAM on - so we take the
// upload over its streaming multipart/HTTPUpload path, writing the raw .gif to
// LittleFS in small chunks, then decode it on the done callback.
File uploadFile;
bool spriteDecodePending = false;
ActiveApp spriteDecodeSlot = APP_CLAUDE;
bool spriteDecodeWorking = true;

void handleSpriteUploadChunk(const char *gifPath) {
  HTTPUpload &upload = webServer.upload();
  if (upload.status == UPLOAD_FILE_START) {
    uploadFile = LittleFS.open(gifPath, "w");
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (uploadFile) uploadFile.write(upload.buf, upload.currentSize);
  } else if (upload.status == UPLOAD_FILE_END || upload.status == UPLOAD_FILE_ABORTED) {
    if (uploadFile) uploadFile.close();
  }
}

void handleSpriteUploadDone(ActiveApp slot, bool working = true) {
  const char *gifPath = (slot == APP_CLAUDE) ? (working ? "/c_work.gif" : "/c_idle.gif")
                                            : (working ? "/x_work.gif" : "/x_idle.gif");
  if (spriteDecodePending) {
    webServer.send(409, "text/plain", "another sprite is still decoding");
    return;
  }
  File f = LittleFS.open(gifPath, "r");
  bool uploaded = f && f.size() > 0;
  if (f) f.close();
  if (!uploaded) {
    webServer.send(400, "text/plain", "empty GIF upload");
    return;
  }
  // Do not hold the HTTP connection open during AnimatedGIF/LittleFS work.
  spriteDecodeSlot = slot;
  spriteDecodeWorking = working;
  spriteDecodePending = true;
  webServer.send(202, "text/plain", "accepted; GIF decoding in background");
  Serial.printf("[sprite] upload received (%s), queued for background decode\n", gifPath);
}

void processPendingSpriteDecode() {
  if (!spriteDecodePending) return;
  spriteDecodePending = false;
  ActiveApp slot = spriteDecodeSlot;
  bool working = spriteDecodeWorking;
  const char *gifPath = (slot == APP_CLAUDE) ? (working ? "/c_work.gif" : "/c_idle.gif")
                                            : (working ? "/x_work.gif" : "/x_idle.gif");
  const char *binPath = (slot == APP_CLAUDE) ? (working ? CLAUDE_SPRITE_FILE : CLAUDE_IDLE_FILE)
                                            : (working ? CODEX_SPRITE_FILE : CODEX_IDLE_FILE);
  int tw = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
  int th = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
  bool ok = decodeGifToBin(gifPath, binPath, tw, th);
  LittleFS.remove(gifPath);
  if (ok) {
    spriteRev++;
    loadCustomSpriteState();
    if (slot == APP_CLAUDE) claudeFrame = 0;
    else codexFrame = 0;
    if (currentApp == slot) drawActiveApp();
    Serial.println("[sprite] gif decoded & applied");
  } else {
    Serial.println("[sprite] gif decode FAILED");
  }
}

void setupWebServer() {
  webServer.on("/", HTTP_GET, handleRoot);
  webServer.on("/save", HTTP_POST, handleSave);
  webServer.on("/reset-wifi", HTTP_POST, handleResetWifi);
  webServer.on("/api/info", HTTP_GET, handleApiInfo);
  webServer.on("/api/display", HTTP_POST, handleApiDisplay);
  webServer.on("/api/bridge", HTTP_POST, handleApiBridge);
  webServer.on("/api/brightness", HTTP_POST, handleApiBrightness);
  webServer.on("/api/volume", HTTP_POST, handleApiVolume);
  webServer.on("/api/preview-sound", HTTP_POST, handleApiPreviewSound);
  webServer.on("/api/quota-display", HTTP_POST, handleApiQuotaDisplay);
  webServer.on("/sprite/claude/reset", HTTP_POST, []() { handleSpriteReset(APP_CLAUDE); });
  webServer.on("/sprite/codex/reset", HTTP_POST, []() { handleSpriteReset(APP_CODEX); });
  webServer.on("/sprite/claude/raw", HTTP_GET, []() { handleSpriteRaw(APP_CLAUDE); });
  webServer.on("/sprite/codex/raw", HTTP_GET, []() { handleSpriteRaw(APP_CODEX); });
  webServer.on(
      "/sprite/claude", HTTP_POST, []() { handleSpriteUploadDone(APP_CLAUDE); },
      []() { handleSpriteUploadChunk(CLAUDE_GIF_FILE); });
  webServer.on(
      "/sprite/codex", HTTP_POST, []() { handleSpriteUploadDone(APP_CODEX); },
      []() { handleSpriteUploadChunk(CODEX_GIF_FILE); });
  webServer.on("/sprite/claude/work", HTTP_POST, []() { handleSpriteUploadDone(APP_CLAUDE, true); },
               []() { handleSpriteUploadChunk("/c_work.gif"); });
  webServer.on("/sprite/claude/idle", HTTP_POST, []() { handleSpriteUploadDone(APP_CLAUDE, false); },
               []() { handleSpriteUploadChunk("/c_idle.gif"); });
  webServer.on("/sprite/codex/work", HTTP_POST, []() { handleSpriteUploadDone(APP_CODEX, true); },
               []() { handleSpriteUploadChunk("/x_work.gif"); });
  webServer.on("/sprite/codex/idle", HTTP_POST, []() { handleSpriteUploadDone(APP_CODEX, false); },
               []() { handleSpriteUploadChunk("/x_idle.gif"); });
  webServer.begin();
  Serial.printf("[web] admin server listening on http://%s/\n", WiFi.localIP().toString().c_str());
}

// Keep HTTP processing off the Arduino UI loop. ESP32 has FreeRTOS tasks
// rather than separate processes; pin the lightweight WebServer task to the
// other core so TFT SPI drawing cannot starve management requests.
void webServerTask(void *) {
  for (;;) {
    webServer.handleClient();
    vTaskDelay(pdMS_TO_TICKS(1));
  }
}

void startWebServerIfNeeded() {
  if (webServerStarted || WiFi.status() != WL_CONNECTED) return;
  setupWebServer();
  webServerStarted = true;
  xTaskCreatePinnedToCore(webServerTask, "http", 6144, nullptr, 1, nullptr, 0);
}

// ---------- Arduino entry points ----------

void setup() {
  Serial.setRxBufferSize(2048);
  Serial.begin(115200);
  // The M5 custom partition is explicitly named "littlefs". A freshly
  // flashed volume is blank, so format that exact partition once on failure
  // and then mount it again. Passing the label avoids Core-specific automatic
  // partition discovery that can miss the custom label.
  const char *littlefsLabel = "littlefs";
  bool fsMounted = LittleFS.begin(false, "/littlefs", 10, littlefsLabel);
  if (!fsMounted) {
    Serial.println("[fs] initial LittleFS mount failed; formatting partition");
    if (LittleFS.format()) fsMounted = LittleFS.begin(false, "/littlefs", 10, littlefsLabel);
  }
  if (!fsMounted) {
    Serial.println("[fs] LittleFS mount failed; persistent settings unavailable");
  } else {
    Serial.println("[fs] LittleFS mounted");
  }
  loadBridgeHost();
  loadBrightness();
  loadCompletionVolume();
  loadQuotaDisplay();
  loadDisplayMode();
  loadCustomSpriteState();

  tft.init();
#if defined(M5STACK)
  initM5GoV26Panel();
#endif
  // M5Stack's official Core1 display wrapper uses rotation 1 after selecting
  // the ILI9342C init path, yielding the expected 320x240 landscape canvas.
#if defined(T_EMBED_CC1101)
  tft.setRotation(0);
#elif defined(XIAOZHI_S3_LCD154)
  // The Zhengchen 1.54-inch panel is physically mounted 180 degrees from
  // the M5Stack landscape reference orientation used by this UI.
  tft.setRotation(3);
#else
  tft.setRotation(1);
#endif
  tft.fillScreen(TFT_BLACK);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(TFT_BL, BRIGHTNESS_PWM_FREQ, 8);
#else
  ledcSetup(0, BRIGHTNESS_PWM_FREQ, 8);
  ledcAttachPin(TFT_BL, 0);
#endif
  applyBrightness();
#if defined(XIAOZHI_S3_LCD154)
  // The original board firmware keeps this power-control pin high.
  pinMode(2, OUTPUT);
  digitalWrite(2, HIGH);
  initI2sSpeaker();
#endif
#if defined(HAS_DAC_SPEAKER)
  ledcSetup(SPEAKER_CHANNEL, 2000, 8);
  ledcAttachPin(SPEAKER_PIN, SPEAKER_CHANNEL);
  ledcWriteTone(SPEAKER_CHANNEL, 0);
#endif

  setupWiFi();
  if (WiFi.status() == WL_CONNECTED) {
    startWebServerIfNeeded();
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString("WiFi connected", 8, 70, 2);
    tft.drawString("Admin page:", 8, 100, 2);
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.drawString("http://" + WiFi.localIP().toString(), 8, 125, 2);
    delay(3000);
    showMainUiIfNeeded();
    pollBridge();
  }
}

void loop() {
  wifiManager.process();
  pumpSerial();
  if (previewSoundRequested) {
    previewSoundRequested = false;
    triggerCompletionBeep();
  }
  if (!webServerStarted && WiFi.status() == WL_CONNECTED) {
    startWebServerIfNeeded();
    showMainUiIfNeeded();
    lastPollMs = 0;
  }
  if (!mainUiShown) return;

