liuaiolos/esp8266-ai/firmware/src/main.cpp
  updateBeep();
  processPendingSpriteDecode();
  unsigned long nowMs = millis();

  // Effective mode may differ from the configured one (AUTO -> music while
  // audio plays). On a transition, reset the incoming mode's chrome so it
  // repaints cleanly, and repaint the pet immediately when returning to it.
  DisplayMode eff = effectiveMode();
  if (appRedrawRequested && eff != MODE_NET && eff != MODE_MUSIC) {
    appRedrawRequested = false;
    updateActiveApp();
    drawActiveApp();
  }
  if (eff != lastEffectiveMode) {
    lastEffectiveMode = eff;
    if (eff == MODE_NET) {
      netChromeDrawn = false;
      lastNetPollMs = 0;
    } else if (eff == MODE_MUSIC) {
      musicChromeDrawn = false;
      lastMusicPollMs = 0;
    } else {
      updateActiveApp();
      drawActiveApp();
    }
  }

  if (eff == MODE_NET) {
    // net-speed mode: rendering (constant-rate sweep) is independent of the
    // bridge polls that refill its sample queue
    if (nowMs - lastNetDrawMs >= NET_DRAW_INTERVAL_MS) {
      lastNetDrawMs = nowMs;
      netDrawTick();
    }
    if (nowMs - lastNetPollMs >= NET_POLL_INTERVAL_MS) {
      lastNetPollMs = nowMs;
      pollNet();
    }
  } else if (eff == MODE_MUSIC) {
    // music now-playing mode: cover art + track metadata from the bridge
    if (nowMs - lastMusicPollMs >= MUSIC_POLL_INTERVAL_MS) {
      lastMusicPollMs = nowMs;
      pollMusic();
    }
  } else {
    // sprite walk-cycle animation (only advances while that app is showing)
    if (nowMs - lastAnimMs >= ANIM_INTERVAL_MS) {
      lastAnimMs = nowMs;
      bool claudeWorking = claudeStatus.status == "working";
      bool codexWorking = codexStatus.status == "working";
      if (!claudeWorking) claudeLoopBridgePending = false;
      if (!codexWorking) codexLoopBridgePending = false;
      bool drewLoopBridge = false;
      if (showingCd != CD_NONE) {
        // countdown owns the center area: no sprite frames over it
      } else if (currentApp == APP_CLAUDE && claudeWorking) {
        int count = claudeFrameCount();
        if (claudeLoopBridgePending) {
          claudeFrame = 0;
          claudeLoopBridgePending = false;
          drawClaudeSprite(claudeFrame);
        } else if (count > 1 && claudeFrame + 1 >= count) {
          drawClaudeLoopBridge();
          claudeLoopBridgePending = true;
          drewLoopBridge = true;
        } else {
          claudeFrame = (claudeFrame + 1) % count;
          drawClaudeSprite(claudeFrame);
        }
      } else if (currentApp == APP_CODEX && codexWorking) {
        int count = codexFrameCount();
        if (codexLoopBridgePending) {
          codexFrame = 0;
          codexLoopBridgePending = false;
          drawCodexSprite(codexFrame);
        } else if (count > 1 && codexFrame + 1 >= count) {
          drawCodexLoopBridge();
          codexLoopBridgePending = true;
          drewLoopBridge = true;
        } else {
          codexFrame = (codexFrame + 1) % count;
          drawCodexSprite(codexFrame);
        }
      } else if (currentApp == APP_CLAUDE && claudeIdleCustom) {
        claudeFrame = (claudeFrame + 1) % claudeIdleFrameCount();
        drawClaudeSprite(claudeFrame, false);
      } else if (currentApp == APP_CLAUDE && claudeFrame != 0) {
        claudeFrame = 0;
        drawClaudeSprite(claudeFrame, false);
      } else if (currentApp == APP_CODEX && codexIdleCustom) {
        codexFrame = (codexFrame + 1) % codexIdleFrameCount();
        drawCodexSprite(codexFrame, false);
      } else if (currentApp == APP_CODEX && codexFrame != 0) {
        codexFrame = 0;
        drawCodexSprite(codexFrame, false);
      }
      if (drewLoopBridge) {
        // The bridge is a transition, not another full-duration GIF frame.
        lastAnimMs = nowMs - (ANIM_INTERVAL_MS - ANIM_LOOP_BRIDGE_MS);
      }
    }

    // countdown seconds tick locally between bridge polls
    static unsigned long lastCdTickMs = 0;
    if (showingCd != CD_NONE && nowMs - lastCdTickMs >= 1000) {
      lastCdTickMs = nowMs;
      drawCountdown(false);
    }

    // "urgent" flash toggle (independent, faster cadence)
    if (nowMs - lastFlashMs >= FLASH_INTERVAL_MS) {
      lastFlashMs = nowMs;
      flashOn = !flashOn;
      if (bridgeStale()) {
        redrawRingOnly();
      } else if (currentAppNeedsInput()) {
        // approval needed: blink the whole border red, restore the quota ring
        // on the off-phase so it doesn't erase the normal chrome permanently
        if (flashOn) drawFullBorder(TFT_RED);
        else redrawRingOnly();
      }
    }

    // alternate which app is shown when neither/both are uniquely working
    if (updateActiveApp()) {
      drawActiveApp();
    }
  }

  // While serial frames are fresh, use the wired payloads exclusively to
  // avoid duplicate updates and make AP client isolation irrelevant.
  if (nowMs - lastPollMs >= BRIDGE_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;
    if (!wiredActive()) pollBridge();
  }
}
